# Insert and Delete Function

In [57]:
import pandas as pd

In [58]:
data1 = pd.DataFrame(
    {
        'Name':['Adam', 'Neha', 'Sara', "John"],
        'Gender':['male', 'female', 'female', 'male']
    }
)

data1

   Name  Gender
0  Adam    male
1  Neha  female
2  Sara  female
3  John    male

# insert Age Column and Values

-  index (for column), Column Name, Values

In [59]:
data1.insert(2,'Age',[23,25,24,24])

print(data1)

   Name  Gender  Age
0  Adam    male   23
1  Neha  female   25
2  Sara  female   24
3  John    male   24

# Delete : pop
- Delete Gender Column

In [60]:
data1.pop('Gender')
data1

   Name  Age
0  Adam   23
1  Neha   25
2  Sara   24
3  John   24